In [2]:
# Using pandas only for more readable results
import pandas as pd
from sqlalchemy import create_engine

In [3]:
POSTGRES_USER = "postgres"
POSTGRES_PASSWORD = "postgres"
POSTGRES_PORT = 5432
engine = create_engine(f"postgresql://{POSTGRES_USER}:{POSTGRES_PASSWORD}@localhost:{POSTGRES_PORT}")

In [142]:
# Percent of symbols for which Adj.Close(t) > Average(Adj_close{t-40:t}) for at least one t in 2019
# WARNING: this query takes a while to run
res = pd.read_sql_query('''
     WITH symbols AS (SELECT DISTINCT(symbol) FROM bars_1),
     ordered_bars AS (SELECT symbol, date, adj_close FROM bars_1 ORDER BY symbol, date, adj_close)
     
     SELECT COUNT(1) * 100.0 / (SELECT COUNT(1) FROM symbols) as percentage
     FROM symbols
     WHERE symbol = (
        SELECT symbol
        FROM ordered_bars AS b1
        WHERE DATE_PART('year', date) = 2019 AND symbols.symbol = b1.symbol AND adj_close > (
            SELECT AVG(adj_close)
            FROM ordered_bars AS b2
            WHERE b2.symbol = b1.symbol AND b1.date - b2.date <= 40
        )
        LIMIT 1
    )
''', con=engine)
res

   percentage
0   36.458333

In [143]:
# Dolar volume in February 2019
res = pd.read_sql_query('''
    SELECT SUM(adj_close * volume) AS dolar_volume, date
    FROM bars_1
    WHERE DATE_PART('year', date) = 2019 AND DATE_PART('month', date) = 2
    GROUP BY date
''', con=engine)
res

    dolar_volume        date
0   2.815901e+10  2019-02-01
1   2.506800e+10  2019-02-04
2   2.380323e+10  2019-02-05
3   2.069815e+10  2019-02-06
4   3.176642e+10  2019-02-07
5   3.038882e+10  2019-02-08
6   2.996531e+10  2019-02-11
7   3.484913e+10  2019-02-12
8   2.373543e+10  2019-02-13
9   3.074257e+10  2019-02-14
10  2.983230e+10  2019-02-15
11  3.137541e+10  2019-02-19
12  3.520802e+10  2019-02-20
13  2.742563e+10  2019-02-21
14  1.858870e+10  2019-02-22
15  2.769651e+10  2019-02-25
16  2.480834e+10  2019-02-26
17  2.066113e+10  2019-02-27
18  3.066526e+10  2019-02-28

In [144]:
# Average dolar volume in February 2019
res = pd.read_sql_query('''
    SELECT AVG(dolar_volume)
    FROM (
        SELECT SUM(adj_close * volume) AS dolar_volume, date
        FROM bars_1
        WHERE DATE_PART('year', date) = 2019 AND DATE_PART('month', date) = 2
        GROUP BY date
    ) AS tmp
''', con=engine)
res

            avg
0  2.765460e+10

In [145]:
# Rank stocks in 2015 by Positive Volume in ascending order
res = pd.read_sql_query('''
    WITH ordered_bars AS (SELECT symbol, date, adj_close, volume FROM bars_1 WHERE DATE_PART('year', date) = 2015 ORDER BY symbol, date, adj_close, volume),
    positive_volume_bars AS (
        SELECT symbol, SUM(
            CASE
                WHEN adj_close > COALESCE((SELECT adj_close FROM ordered_bars AS b2 WHERE b2.symbol = b1.symbol AND b1.date - b2.date = 1), 0)
                THEN volume
                ELSE 0
            END) AS positive_volume
        FROM ordered_bars AS b1
        GROUP BY b1.symbol
    )

    SELECT symbol, positive_volume, RANK () OVER (ORDER BY positive_volume ASC) rank_number
    FROM positive_volume_bars
''', con=engine)
res

    symbol  positive_volume  rank_number
0     CARR     0.000000e+00            1
1      TER     0.000000e+00            1
2      UNH     0.000000e+00            1
3     VICI     0.000000e+00            1
4     AMCR     7.100000e+03            5
..     ...              ...          ...
185   TSLA     2.048492e+09          186
186      T     3.882087e+09          187
187    BAC     7.964311e+09          188
188   AMZN     8.471366e+09          189
189   AAPL     2.020461e+10          190

[190 rows x 3 columns]

In [ ]:
# For each stock calculate average absolute daily percent change
# WARNING: this query takes a WHILE to run(hours)
res = pd.read_sql_query('''
    WITH ordered_bars AS (SELECT symbol, date, close FROM bars_1 ORDER BY symbol, date, close),
    previous_close AS (
        SELECT symbol, close, COALESCE((SELECT close FROM ordered_bars AS b2 WHERE b2.symbol = b1.symbol and b1.date - b2.date = 1), 0) as prev_close
        FROM ordered_bars AS b1
    )
    
    SELECT AVG(ABS(close - prev_close) * 100.0 / close), symbol
    FROM previous_close
    WHERE prev_close != 0
    GROUP BY symbol
''', con=engine)
res

In [4]:
# For each stock calculate average absolute daily percent change
# It's a bit different query - instead of looking for previous day, we take a previous row in ordered table.
# This one runs MUCH faster but it's not calculating "average absolute daily percent change" per se if
# we don't have data from each day for each symbol
res = pd.read_sql_query('''
    WITH ordered_bars AS (SELECT symbol, date, close FROM bars_1 ORDER BY symbol, date, close),
    previous_close AS(
        SELECT symbol, close, COALESCE(LAG(close) OVER(PARTITION BY symbol ORDER BY date), 0) AS prev_close
        FROM ordered_bars
    )

    SELECT AVG(ABS(close - prev_close) * 100.0 / close), symbol
    FROM previous_close
    WHERE prev_close != 0
    GROUP BY symbol
''', con=engine)
res

          avg symbol
0    1.687396      A
1    3.163658    AAL
2    1.737145    AAP
3    1.737536   AAPL
4    1.650537   ABBV
..        ...    ...
184  1.377875    YUM
185  1.511720    ZBH
186  1.989076   ZBRA
187  2.129160   ZION
188  1.449178    ZTS

[189 rows x 2 columns]